Revit 2027 API
ProjectInfo.Status Property
Get or Set the Project Status of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Status { get; set; }
Public Property Status As String
	Get
	Set
public:
property String^ Status {
	String^ get ();
	void set (String^ value);
}
member Status : string with get, set
Property Value
String
Remarks
This property is used to get or set the Project Status of the Project Information.
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace